In [25]:
import pandas as pd
import numpy as np

In [7]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}

df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [11]:
df.groupby("Team")["Points"].sum()

Team
Devils    1536
Kings     2285
Riders    3049
Royals    1505
kings      812
Name: Points, dtype: int64

In [16]:
df.groupby(["Team","Year"])["Points"].sum().unstack()

Year     2014   2015   2016   2017
Team
Devils  863.0  673.0    NaN    NaN
Kings   741.0    NaN  756.0  788.0
Riders  876.0  789.0  694.0  690.0
Royals  701.0  804.0    NaN    NaN
kings     NaN  812.0    NaN    NaN

In [19]:
grouped = df.groupby("Team")

for name,group in grouped:
    print(name)
    print(group)

Devils
     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673
Kings
    Team  Rank  Year  Points
4  Kings     3  2014     741
6  Kings     1  2016     756
7  Kings     1  2017     788
Riders
      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
8   Riders     2  2016     694
11  Riders     2  2017     690
Royals
      Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804
kings
    Team  Rank  Year  Points
5  kings     4  2015     812

In [21]:
grouped.get_group("Devils")

     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673

In [32]:
grouped.aggregate(sum)
grouped.aggregate([np.mean,np.sum])

            Rank             Year            Points
            mean sum         mean   sum        mean   sum
Team
Devils  2.500000   5  2014.500000  4029  768.000000  1536
Kings   1.666667   5  2015.666667  6047  761.666667  2285
Riders  1.750000   7  2015.500000  8062  762.250000  3049
Royals  2.500000   5  2014.500000  4029  752.500000  1505
kings   4.000000   4  2015.000000  2015  812.000000   812

In [33]:
grouped.transform(lambda x : (x - np.mean(x)) / np.std(x))

        Rank      Year    Points
0  -1.732051 -1.341641  1.483013
1   0.577350 -0.447214  0.348753
2  -1.000000 -1.000000  1.000000
3   1.000000  1.000000 -1.000000
4   1.414214 -1.336306 -1.054336
5        NaN       NaN       NaN
6  -0.707107  0.267261 -0.289092
7  -0.707107  1.069045  1.343429
8   0.577350  0.447214 -0.889808
9   1.000000 -1.000000 -1.000000
10 -1.000000  1.000000  1.000000
11  0.577350  1.341641 -0.941958